[
 {
    "lecturer": "Dr Andrew Gascoyne",
    "field": "Senior Lecturer in Mathematics",
    "description": "Dr Andrew Gascoyne is a Senior Lecturer in the School of Mathematics and Computer Science.  Prior to that he worked as a postdoctoral research associate at The University of Sheffield on the STFC funded project entitled 'Magnetic Features and Local Helioseismology. He graduated in 2007 from the University of Sheffield with an MMath in Mathematics and went on to study a PhD in Applied Mathematics of which he was awarded in 2011.  He started working at the University of Wolverhampton in 2015 where he not only continues to his research in Solar Physics but he also is a collaborator within the Wolverhampton Light & Matter Research Group (WLM) and Wolverhampton Cyber Research Institute (WCRI).  He is passionate about mathematics education within Higher Education as a member of the Higher Education Academy (HEA) and the dissemination of mathematics to wider society. I am currently involved in external projects which try to tackle the Maths GCSE barrier which is a large obstacle to many people who have ambitions on a career in the STEMM (Science, Technology, Mathematics and Medicine) fields.",
    "email": " A.D.Gascoyne@wlv.ac.uk",
    "profile": "https://researchers.wlv.ac.uk/A.D.Gascoyne",
    "contact": "01902518576",
    "publication": "Raising aspirations using elements of team-based learning in mathematics: a pilot study, Dynamics of charged particle motion in the vicinity of three dimensional magnetic null points: Energization and chaos, Five-minute oscillation power within magnetic elements in the solar atmosphere, Energy loss of solar p modes due to the excitation of magnetic sausage tube waves: importance of coupling the upper atmosphere, Sensitivity of p-mode absorption on magnetic region properties and kernel functions, Axisymmetric absorption of p modes by an ensemble of thin, magnetic-flux tubes, Interaction of p modes with a collection of thin magnetic tubes, Damping rates of p-modes by an ensemble of randomly distributed thin magnetic flux tubes, The role of magnetic fields in the scattering of p-modes.",
    "researchinterest": "My research interests are in the broad area of Mathematical Modelling using computational as well as analytical techniques in areas such as Solar Physics, Quantum Physics, Biology.  My main area of expertise concerns physical processes on the Sun.  Solar physics is the branch of astrophysics that specialises in the study of the Sun. I am focused on Helioseismology, the study of acoustic wave propagation within the interior of the Sun, and MHD (magnetohydrodynamics) wave propagation. Mathematical modelling is a vital part of this research in order to compare and predict observational signatures and understand the many complex mechanisms and processes involved in the interaction of the solar acoustic modes with magnetic elements on the Sun i.e., Sunspots and Plage regions."
  },
  {
    "lecturer": "Dr Eva Navarro Lopez",
    "field": "Reader in Data Science",
    "description": "Eva is a passionate scientist and an inspiring educator. With a passion for research and wide span of interests, her area of expertise defies easy compartmentalisation, and the multidisciplinary approach she has developed sets her apart from her computer science peer group. Her natural inclination is to open new pathways rather than re-tread old ones. She has an acknowledged ability to build new areas of research from scratch, identify key problems and raise questions that have not been voiced before. She approaches the answers in an original way by transferring ideas from one field to another. Few computer scientists can credibly claim to have controlled walking robots, eliminated mechanical vibration in oil fields, introduced formal methods of computer science into dynamical systems theory, and modelled important aspects of the human brain to create a new theory of neuroplasticity with the potential to radically change the study of the brain and neuromorphic computing.Eva is a scientist of international standing in hybrid dynamical systems, cyber-physical systems, network science, mathematical modelling, simulation, automated verification and reasoning, formal methods of computer science, symbolic artificial intelligence (AI), automation, control engineering, robotics, stability of dynamical systems, evolution of complex systems, self-organisation, advanced algorithms, computational neuroscience, neuro-inspired computing, data science and collective intelligence.Eva has developed her career in industry and academia in three different countries: Mexico, the UK and Spain. She shadowed the footsteps of Alan Turing in Manchester, 2008-2020, and Santiago Ramón y Cajal in Madrid, 2016-17. She is one of the world's experts in Turing's morphogenesis –having collaborated with the last Alan Turing’s student. She is currently proposing new models of computation, learning and evolution for complex systems as a Reader in Data Science and Director and founder of AiDAs, the Artificial intelligence and DAta science Research Lab at the School of Mathematics and Computer Science in the University of Wolverhampton. She is also modelling important aspects of the human brain. Embedded within the nascent field of cyber-physical social systems, she is also a Honorary Senior Research Fellow of the Spatial Policy Lab of the Manchester Urban Institute and the School of Environment, Education and Development at The University of Manchester, where she applies network and data science to analyse social and urban dynamics. Moreover, she is part of the core team of AI Mexico, which promotes artificial intelligence (AI) education and its responsible adoption by industry. AI Mexico is the coordinating institution of the Coalition IA2030Mx, a key coalition for the National Agenda for AI of Mexico.Eva has developed her career in industry and academia in three different countries: Mexico, the UK and Spain. She shadowed the footsteps of Alan Turing in Manchester, 2008-2020, and Santiago Ramón y Cajal in Madrid, 2016-17. She is one of the world's experts in Turing's morphogenesis –having collaborated with the last Alan Turing’s student. She is currently proposing new models of computation, learning and evolution for complex systems as a Reader in Data Science and Director and founder of AiDAs, the Artificial intelligence and DAta science Research Lab at the School of Mathematics and Computer Science in the University of Wolverhampton. She is also modelling important aspects of the human brain. Embedded within the nascent field of cyber-physical social systems, she is also a Honorary Senior Research Fellow of the Spatial Policy Lab of the Manchester Urban Institute and the School of Environment, Education and Development at The University of Manchester, where she applies network and data science to analyse social and urban dynamics. Moreover, she is part of the core team of AI Mexico, which promotes artificial intelligence (AI) education and its responsible adoption by industry. AI Mexico is the coordinating institution of the Coalition IA2030Mx, a key coalition for the National Agenda for AI of Mexico. Eva is one of the 7 founders of ACM-Women Europe  (the Association for Computing Machinery’s Council on Women in Computing in Europe) and the founder of the ACM womENcourage conference series in Europe. She is also a member of the UNESCO Inclusive Policy Lab, member of the British Computer Society (BCS) Women in Computing Research Committee of the BCS Academy of Computing. She has recently joined Technolatinas, a community to bring together technologists and scientists from Latin America and all around the world to support each other and advocate for equality, diversity and inclusion. In Wolverhampton, she is continuing her work on equality, inclusion and diversity as the Chair of the new Athena Swan Task Force Group within the School of Mathematics and Computer Science. Eva is also a lover of philosophy, arts, music and poetry.",
    "email": "e.navarrolopez@wlv.ac.uk",
    "profile": "https://researchers.wlv.ac.uk/e.navarrolopez",
    "publication": "Detecting shifts in metropolitan structure: a spatial network perspective, A dynamical model for the basal ganglia-thalamo-cortical oscillatory activity and its implications in Parkinson’s disease,  Automated generation of hybrid automata for multi-rigid-body mechanical systems and its application to the falsification of safety properties, Towards an interpretable model for automatic classification of endoscopy images, A novel hybrid automaton framework for multi-phase epidemic modelling, Stability of planar switched systems under delayed event detection, A novel hybrid automaton framework for multi-phase epidemic modelling, A feature-based ontology for cyber-physical systems, A feature-based ontology for cyber-physical systems, Evolution of communities of software: using tensor decompositions to compare software ecosystems, Coloured graphlet profiles as a predictor of career length in scientific co-authorship networks, Tracking the evolution of the English language as a network with temporal clustering, Approximated stability analysis of bi-modal hybrid co-simulation scenarios, Feedback stability for dissipative switched systems, Local feedback dissipativity through energy invariance and feedback losslessness properties in nonlinear discrete-time systems, Local feedback dissipativity through energy invariance and feedback losslessness properties in nonlinear discrete-time systems, The coevolution of sexual imprinting by males and females, Deadness and how to disprove liveness in hybrid dynamical systems, A computational model describing the interplay of basal ganglia and subcortical background oscillations during working memory processes ,Hybrid Systems Neuroscience ,Group and total dissipativity and stability of multi-equilibria hybrid automata ,Towards ℓ<inf>2</inf>-stability of discrete-time reset control systems via dissipativity theory ,Dynamically-driven timed automaton abstractions for proving liveness of continuous systems",
    "researchinterest": "The core of my research is dynamical systems, computational science and industrial automation. However, I have always challenged the existing orthodoxy in these areas and have combined five classically-separated disciplines: computer science, artificial intelligence (AI), control engineering, mathematical systems analysis and network science –with strong links to industry. I am a leading researcher in various aspects of hybrid dynamical systems, cyber-physical systems, control systems, automated formal verification, stability theory, complex networks and symbolic AI, as well as self-organising systems, with applications in brain networks, evolution in ecology, gene regulatory networks, software dependency networks, social networks, collective behaviour in animals, cells and people, electromechanical systems, robotics, power electronics, smart grids, systems biology, smart cities, drilling mechanisms, oil and gas networks, and distribution and transportation networks. Uniquely, I have made key contributions to the theory of dissipative nonlinear discrete-time systems and hybrid automata, and to the automated verification and control of diverse discontinuous/switched, hybrid and cyber-physical systems, Network science and machine learning for collective intelligence in evolving social systems, Machine learning and data science for health, Dynamical systems theory, network and data science for social computing, Safety- and security-critical infrastructures"
    
  },
  {
    "lecturer": "Mr Ahsan Adeel",
    "field": "Reader in Artificial Intelligence",
    "description": "Dr Adeel is an internationally recognised expert in brain-inspired multimodal information processing. He is the Deputy Director, Wolv PI, and Lead CI of the prestigious EPSRC £4 million transformative healthcare technologies (2050) programme grant, along with Prof. Hussain (PI). His proposed multisensory 5G IoT-enabled audio-visual (AV) hearing aid (HA) project is ranked second in the EPSRC’s healthcare technologies grand challenge of frontiers of physical intervention. EPSRC believes that the project vision represents a step-change in how healthcare will be delivered in future. As a PI, he is leading vision 2050, which aims to leverage the complementary strengths of both the cloud-based system and internet-independent 'brain-like' on-chip MM big data processing, to enable contextual switching option in HA by 2050. ",
    "email": " A.Adeel@wlv.ac.uk",
    "profile": " https://researchers.wlv.ac.uk/a.adeel",
    "publication": "A novel real-time, lightweight chaotic-encryption scheme for next-generation audio-visual hearing aids, Contextual deep learning-based audio-visual switching for speech enhancement in real-world environments., Deep Cognitive Neural Network (DCNN).,Cognitively inspired feature extraction and speech recognition for automated hearing loss testing., Resource Management and Inter-Cell-Interference Coordination in LTE Uplink System Using Random Neural Network and Optimization., Canonical cortical graph neural networks and its application for speech enhancement in audio-visual hearing aids., PL-kNN: A Python-based implementation of a parameterless k-Nearest Neighbours classifier [Formula presented].,Multimodal audio-visual information fusion using canonical-correlated Graph Neural Network for energy-efficient speech enhancement., A Novel Chaos-based Light-weight Image Encryption Scheme for Multi-modal Hearing Aids., A Novel Frame Structure for Cloud-Based Audio-Visual Speech Enhancement in Multimodal Hearing-aids., A Novel Speech Intelligibility Enhancement Model based on Canonical Correlation and Deep Learning., PL-k NN: A Parameterless Nearest Neighbors Classifier., A Semi-supervised Approach for Sentiment Analysis of Arab(ic+izi) Messages: Application to the Algerian Dialect., Sentiment analysis of persian movie reviews using deep learning., Detecting hate speech against politicians in Arabic community on social media., An adversarial approach for intrusion detection systems using jacobian saliency map attacks (Jsma) algorithm., Conscious multisensory integration: Introducing a universal contextual field in biological and deep artificial neural networks., A novel statistical analysis and autoencoder driven intelligent intrusion detection approach., CochleaNet: A robust language-independent audio-visual model for real-time speech enhancement., BrainOS: A Novel Artificial Brain-Alike Automatic Machine Learning Framework., Height prediction for growth hormone deficiency treatment planning using deep learning., Offline Arabic handwriting recognition using deep machine learning: A review of recent advances., A novel deep learning driven, low-cost mobility prediction approach for 5G cellular networks: The case of the Control/Data Separation Architecture (CDSA)., Lip-reading driven deep learning approach for speech enhancement., Improving channel utilization of LoRaWAN by using novel channel access mechanism",
    "researchinterest": " Explainable artificial intelligence, Contextual audio-visual speech processing, Biophysical and hardware-efficient neural models, Optimized resource management and decision-making,Context-aware multimodal fusion, Low power 5G IoT devices,Neuromorphic chips."
  },
  {
    
    "lecturer": "Dr Md Arafatur Rahman",
    "field": "Senior lecturer",
    "description": "Md Arafatur Rahman received his Ph.D. degree in Electronic and Telecommunications Engineering from the University of Naples Federico II, Naples, Italy in 2013. He has around 15 years Research and Teaching experience in the domain of Computer and Communications Engineering. Currently, he is a Senior Lecturer with the School of Engineering, Computing & Mathematical Sciences, University of Wolverhampton, UK. He was an Associate Professor with the Faculty of Computing, Universiti Malaysia Pahang, where he had conducted Undergraduate and Masters Courses and supervised more than 21 B.Sc., 5 M.Sc. and 5 PhD students. He worked as a Postdoctoral Research Fellow with University of Naples Federico II in 2014 and Visiting Researcher with the Sapienza University of Rome in 2016. His research interests include Internet-of-Things (IoT), Wireless Communication Networks, Cognitive Radio Network, 5G, Vehicular Communication, Cyber Physical System, Big Data, Cloud-Fog-Edge Computing, Machine Learning and Security. He has developed an excellent track record of academic leadership as well as management and execution of international ICT projects that are supported by agencies in the UK, Italy, EU and Malaysia. Dr. Rahman has received number of prestigious international research awards, notably the Best Paper Award at ICNS’15 (Italy), IC0902 Grant (France), Italian Government PhD Research Scholarship and IIUM Best Masters Student Award, Best Supervisor Award at UMP, Awards in International Exhibitions including Euro Business-HALLER Poland Special Award, MTE 2022, Best Innovation Award, MTE 2020, Malaysia, Diamond and Gold in BiS’17 UK, Best of the Best Innovation Award and Most Commercial IT Innovation Award, Malaysia, and Gold & Silver medals in iENA’17 Germany. Dr. Rahman has co-authored of around 100 prestigious IEEE and Elsevier journal (e.g., IEEE TII, IEEE TITS, IEEE TGCN, IEEE TSC, IEEE COMMAG, Elsevier JNCA, Elsevier FGCS etc.) and conference publications (e.g., IEEE Globecom, IEEE DASC, etc.) and has served as an Specialty Chief Editor of IoT Theory and Fundamental Research (specialty section of Frontiers in the Internet of Things), Advisory Board Member, Editor (Computers, MDPI), Lead Guest Editor (IEEE ACCESS, Computers), Associate Editor (IEEE ACCESS), Patron, General Chair, Organizing Committee, Publicity Chair, Session Chair, Programme Committee and Member of Technical Programme Committee (TPC) in numerous leading conferences worldwide (e.g., IEEE Globecom, IEEE DASC, IEEE iSCI, IEEE ETCCE etc.) and Journals. His name was enlisted inside the World top 2% scientists list released by Stanford University under the category of “Citation Impact in Single Calendar Year 2019-2021”. He was awarded a Higher Education Academy (HEA) Fellowship from the UK. He was a Fellow of IBM Center of Excellence and Earth Resources & Sustainability Center, Malaysia and is a Senior Member of IEEE. He was endorsed by Royal Academy of Engineering, UK as Global Talent under the category of “Exceptional Talent” in 2022.",
    "email": "Arafatur.Rahman@wlv.ac.uk",
    "profile": " https://www.wlv.ac.uk/about-us/our-staff/md-arafatur-rahman/",
    "contact": "01902 321000 Ext.1857",
    "publication": "M. Z. A. Bhuiyan, M. A. Rahman, Q. Liu, X. Zhang and A. T. Asyhari, “Reliability in Sensor-Cloud Systems and Applications,” IEEE Access, 2020. M. A Rahman, Zahir Tari, Dakai Zhu, Francesco Piccialli and Xiaokang Wang , “Cloud – Fog – Edge Computing in Cyber-Physical-Social Systems (CPSS)”, IEEE Access, 2020. M. A. Rahman and A. T. Asyhari, “Convergence of IoT and Big Data towards Industry Revolution 4.0,” International Journal of Engineering and Technology Innovation, 2020. M. A. Rahman and A. T. Asyhari, “Machine Intelligence-Based Sensor Technologies for Scalable IoT Network Infrastructure and Applications,” Computers, 2020. Naveen Chilamkurti, M. A. Rahman, D. Ganesh Gopal “Network Protocols, Schemes, and Mechanisms for Internet of Things Performance Enhancement: Features, Open Challenges, and Trends”, De Gruyter, 2020. Akansha Singh, Vijayalakshmi Saravanan, M. A. Rahman,Machine Learning In Visual Communication & Image Representation, De Gruyter, 2020. Krishna Kant Singh, M. A Rahman, Ahmed A Elngar “Deep Learning for Visual Information Analytics and Management”, Journal of Information Technology Management, 2020. M. A. Rahman and A. T. Asyhari, “The Emergence of Internet of Things (IoT): Connecting Anything, Anywhere,” Computers, vol. 8, no. 2, 2019. M. A. Rahim, M. A. Rahman, M. M. Rahman, A. T. Asyhari, M. Z. A. Bhuiyan and D. Ramasamy, “Evolution of IoT-Enabled Connectivity and Applications in Automobile Industry:A Review,” Elsevier Vehicular Communications, 2020. (ISI Q1 IF= 4.7),M. M. Hasan, M. A. Rahman, A. U. Khasanah, A. T. Asyhari, H. Tao and S. Abubakar, “Search and Rescue Operation in Flooded Areas: A Survey on Emerging Sensor Networking-Enabled IoT-Oriented Technologies and Applications,” Elsevier Cognitive Systems Research (Accepted Minor), 2020. (ISI Q1 IF= 1.9), M. A. Rahman, Nafees Zaman, A. T. Asyhari, Fadi Al-Turjman, M. Z. A. Bhuiyan and M. F. Zolkipli, “Data-Driven Dynamic Clustering Framework for Mitigating the Adverse Economic Impact of Covid-19 Lockdown Practices”, Elsevier Sustainable Cities and Society, 2020. (Elsevier Q1 IF= 5.26),M. A. Rahman, A. T. Asyhari, L. S. Leong, G. B. Satrya, H. Tao and M. F. Zolkipli, “A Secure and Flexible Intrusion Detection System for IoT-Enabled Smart Cities Leveraging Fog-Edge Coordinated Data Analytics,” Elsevier Sustainable Cities and Society, 2020. (Elsevier Q1 IF= 5.26), Md Arafatur Rahman et al., A Scalable Hybrid MAC Strategy for Traffic-Differentiated IoT-enabled Intra-Vehicular Networks, Computer Communications Elsevier, 2020. (Q2 IF= 2.8).Qusay M. Salih, Md. Arafatur Rahman, Fadi Al-Turjman, And Zafril Rizal, Smart Routing Management Framework Exploiting Dynamic Data Resources of Cross-Layer Design and Machine Learning Approaches for Mobile Cognitive Radio Networks: A Survey, IEEE ACCESS. 2020. (ISI Q1 IF= 3.75). Nadia Refat, Md Arafatur Rahman et al., MATT: A Mobile  Assisted  Tense  Tool for Flexible m-Grammar Learning Based on Cloud-Fog-Edge Collaborative Networking. IEEE ACCESS. 2020. (ISI Q1 IF= 3.75). N Refat, H Kassim, MA Rahman, RB Razali, Measuring student motivation on the use of a mobile assisted grammar learning tool, PloS One, 2020. (ISI Q2 IF= 2.74).M. Y. Mukta, Md. Arafatur Rahman, A. Taufiq Asyhari and Md. Zakirul Alam Bhuiyan, IoT for Energy Efficient Green Highway Lighting Systems: Challenges and Issues, Elsevier Journal of Network and Computer Applications, 2020. (ISIQ1 IF=5.57).M.A.  Rahman,  A.  T.  Asyhari,  M.  S.  Obaidat,  I.  F.  Kurniawan,  M.  Y.Mukta,  P.  Vijayakumar,  IoT-enabled  light  intensity-controlled  seamless highway lighting system, in IEEE Systems Journal, 2020. (ISI Q1 IF= 4.46). S. Awang, N. M. A. N. Azmi and M. A. Rahman,Vehicle Type Classification using an Enhanced Sparse-Filtered Convolutional Neural Network with Layer-Skipping Strategy,IEEE ACCESS. 2020. (ISI Q1 IF= 4.09). Hai Tao, Md Zakirul Alam Bhuiyan, Md Arafatur Rahman, Tian Wang, Jie Wu, Sinan Q. Salih, Yafeng Li, and Thaier Hayajneh, “TrustData: Trustworthy and Secured Data Collection for Event Detection in Industrial Cyber-Physical System,” IEEE Transactions on Industrial Informatics, pp. 1-11, 2019. (ISI Q1 IF= 9.112). Md Arafatur Rahman, A. T. Asyhari, Saiful Azad, Md. Munirul Hasan, Cindy P. C. Munaiseche and Made Krisnanda “A Cyber-Enabled Mission-Critical System for Post- Flood Response: Exploiting TV White Space as Network Backhaul Links”, IEEE ACCESS. 2019. (ISI Q1 IF= 4.09). Md. Arafatur. Rahman, Q. M. Salih, A. T. Asyhari and S. Azad, “Travelling Distance Estimation to Mitigate Unnecessary Handoff in Mobile Wireless Networks,” Annals of Telecommunications, 2019. (ISI IF=1.55). Nadia Refat, Md Arafatur Rahman, A. T. Asyhari, Ibnu Febry Kurniawan, Md. Zakirul Alam Bhuiyan and Hafizoah Kassim “Interactive Learning Experience-Driven Smart Communications Networks for Cognitive Load Management in Grammar Learning Context”, IEEE ACCESS. 2019. (ISI Q1 IF= 4.09). Md Arafatur Rahman, SM Nazmus Sadat, A. Taufiq Asyhari, Nadia Refat, Ruzaini Abdullah Arshah and Muhammad Nomani Kabir, “A Secure and Sustainable Framework to Mitigate Hazardous Activities in Online Social Networks”, IEEE Transactions on Sustainable Computing, 2019. Hai Tao, Md. Zakirul Alam Bhuiyan, Md Arafatur Rahman, Guojun Wang, Md. Manjur Ahmed and Tian Wang, “Economic Perspective Analysis of Protecting Big Data Security and Privacy”, Future Generation Computer Systems (Elsevier), 2019 (ISI Q1 IF= 5.768). Vitaly Mezhuyev, SM Nazmus Sadat, Md Arafatur Rahman, Nadia Refat and A. Taufiq Asyhari, “Evaluation of the Likelihood of Friend Request Acceptance in Online Social Networks”, IEEE ACCESS, Vol. 7., pp. 75318 - 75329, 2019. (ISI Q1 IF= 4.09). Md Arafatur Rahman, Saiful Azad, A. Taufiq Asyhari, Md. Zakirul Alam Bhuiyan and Khoirul Anwar, Collab-SAR: A Collaborative Avalanche Search-And-Rescue Missions Exploiting Hostile Alpine Networks, IEEE ACCESS, 2018. (ISI Q1 IF= 4.09). M. A. Rahman, A. T. Asyhari, M. Z. A. Bhuiyan and Q. M. Salih, “L-CAQ: Joint Link-Oriented Channel-Availability and Channel-Quality Based Channel Selection for Mobile Cognitive Radio Networks,” Elsevier Journal of Network and Computer Applications, Sep. 2018. (ISI Q1 IF= 3.99). Md Arafatur Rahman, Vitaly Mezhuyev, M. Z. A. Bhuiyan, SM Nazmus Sadat, Siti Aishah Binti Zakaria and Nadia Refat, “Reliable Decision Making of Accepting Friend Request on Online Social Networks”, IEEE ACCESS, Vol. 6., pp. 9484 – 9491, 2018. (ISI Q1 IF= 4.09). Tian Wang, Md Zakirul Alam Bhuiyan, Guojun Wang, Md. Arafatur Rahman, Jie Wu, and Jiannong Cao, Big Data Reduction for Smart City’s Critical Infrastructural Health Monitoring, IEEE Communication Magazine, 2018 (ISI Q1 IF = 10.435). Entao Luo, Md Zakirul Alam Bhuiyan, Guojun Wang, Md Arafatur Rahman, Jie Wu, and Mohammed Atiquzzaman, PrivacyProtector: Privacy-Protected Patient Data Collection in IoT-based Healthcare Systems, IEEE Communication Magazine, vol. 56, no. 2, pp. 163--168 2018. (ISI Q1 IF = 10.435). Saiful Azad, Md Arafatur Rahman, A. Taufiq Asyhari, Al-Sakib Khan Pathan, Crowd Associated Network: Exploiting over Smart Garbage Management System, IEEE Communications Magazine, 2017 (ISI Q1 IF = 10.435). Saiful Azad, Musfiq Rahman; M. S. A. Noman Ranak; B. M. F. Kamal Ruhee; N. Nourin Nisa; Nazrul Kabir; Arafatur Rahman; Jasni M Zain, VAP Code: A Secure Graphical Password for Smart, Computers & Electrical Engineering (Elsevier), 2017 (ISI Q2 IF = 1.75). Muhammad Nomani Kabir, Md. Arafatur Rahman, Saiful Azad, Mohamed Mostafa A. Azim, Md Zakirul Alam  Bhuiyan, A connection probability model for communications networks under regional failures, International Journal of Critical Infrastructure Protection, 2017 (ISI Q2 IF = 1.5). D. I. Swarna, S. Azad, A. S. K. Pathan, M. A. Rahman, Finding a suitable hop-to-hop busty traffic transmission approach for underwater acoustic networks: handshake-based vs. handshake-free MAC protocols, Int. J. Ad Hoc and Ubiquitous Computing, 2016 (ISI Q4 IF = 0.705). Md Arafatur Rahman, RFID-Based Tracing for Wine Supply Chain, International Journal of Communication Networks and Distributed Systems, 2016 (SCOPUS). Angela Sara Cacciapuoti, Marcello Caleffi, Luigi Paura and Md. Arafatur Rahman, Channel Availability for Mobile Cognitive Radio Networks,  Journal of Network and Computer Applications (Elsevier), 2015 (ISI Q1 IF= 3.5). Zamree Che-aron, Aisha Abdalla, Khaizuran Abdullah, Md. Arafatur Rahman, FTCARP: A Fault-Tolerant Routing Protocol for Cognitive Radio Ad Hoc Networks, KSII Transactions on Internet and Information Systems, 2014 (ISI Q4 IF=0.365). Md. Arafatur Rahman, Marcello Calefﬁ, Luigi Paura, Joint Path and Spectrum Diversity in Cognitive Radio Ad-hoc Networks, EURASIP Journal on Wireless Communications and Networking, 2012 doi:10.1186/1687-1499-2012-235, (ISI Q3 IF=0.627). W. Wei, M. A. Rahman, I. F. Kurniawan, A. T. Asyhari, S. M. N. Sadat and L. Yao,Immune Genetic Algorithm Optimization and Integration of Logistics Network Terminal Resources, 2019 Third IEEE International Conference on Robotic Computing (IRC), Naples, Italy, 2019, pp. 435-436. Md. Arafatur Rahman, M. Y. Mukta, A. Taufiq Asyhari, Md. Zakirul Alam Bhuiyan and C. Y. Yaakub, IoT based Hybrid Green Energy Driven Highway lighting System, IEEE DASC 2019, Japan. W Wei, MA Rahman, MJ Ali, MZA Bhuiyan, L Yao, H Tao, “Overview of Logistics Equilibrium Distribution Networks System: An Urban Perspective”, DepndSys-2018, Australia. MMK Al-Nadwi, N Refat, N Zaman, MA Rahman, MZA Bhuiyan, RB Razali, “Cloud Enabled e-Glossary System: A Smart Campus Perspective”, DepndSys-2018, Australia. Md Zakirul Alam Bhuiyan, Mdaliuz Zaman, Guojun Wang, Tian Wang, and Md. Arafat Rahman, and Hai Tao, Protected Bidding Against Compromised Information Injection in IoT-based Smart Grid, The 2nd EAI International Conference on Smart Grid and Internet of Things (SGIoT 2018), Niagara Falls, Canada, July 11–13, 2018. Ibnu Febry Kurniawan, Md. Arafatur Rahman, A. Taufiq Asyhari and Md. Zakirul Alam Bhuiyan, Performance Evaluation of History-based and Priority-based MAC for Traffic-Differentiated Intra-Vehicular Network, IEEE DASC 2018, Greece. Md. Arafatur Rahman, Md Munirul Hasan, A. Taufiq Asyhari, and Md Zakirul Alam Bhuiyan, A 3D-Collaborative Wireless Network: Towards Resilient Communication for Rescuing Flood Victims, IEEE DASC 2017, Florida, USA. (Accepted). Md Zakirul Alam Bhuiyan, Guojun Wangy, Wang Tianz, Md. Arafatur Rahman, and Jie Wu, Content-Centric Event-Insensitive Big Data Reduction in Internet of Things, Globcom 2017. (Accepted) Qusay Medhat Salih, Md Arafatur Rahman, Md Zakirul Alam Bhuiyan and Zafril Rizal M. Azmi, “The Art of Using Cross-Layer Design in Cognitive Radio Networks”, DependSys 2017 (Accepted). Mohd Sarifuddin bin Othman@Mustafa, Md Arafatur Rahman, Muhammad Nomani Kabir, Kamal Z. Zamli, Enhancing the awareness level on phishing attacks among Malaysians: Analysis and Recommendations, 5th International Conference on Software Engineering & Computer Systems (ICSECS17), Malaysia. Ali. M. H. Abbas, Md Arafatur Rahman, Muhammad Nomani Kabir and Kamal Zuhairi Bin Zamli, Scalable MAC Strategy for Emergency Communication Networks, 5th International Conference on Software Engineering & Computer Systems (ICSECS17), Malaysia.Ali. M. H. Abbas, Jahan Ali, Md Arafatur Rahman and Saiful Azad, Comparative Investigation on CSMA/CA-Based MAC protocols for Scalable Networks, ICCCE 2016, Malaysia. Mohd Ishak Bin Ismail, Md Arafatur Rahman and Saiful Azad, Exploiting Privacy-Policy and -Management Features on Social Networks: A User’s Perspective, ICCCE 2016, Malaysia. Saiful Azad, Leonardo Badia, Arafatur Rahman and Jasni Mohamad Zain, Raising fairness issue of vehicle routing problem, ICITE 2016, Singapore.Md. Arafatur Rahman, Qusay Medhat Salih and Mohamad Fadli Bin Zolkipli, Design a Technique for Minimizing Unnecessary Handoff in Mobile Wireless Networks, The IEEE International Conference on Software Engineering & Computer Systems, Kuantan, August 19-21, 2015. Md. Arafatur Rahman, Muhammad Nomani Kabir, Saiful Azad and Jahan Ali, On Mitigating Hop-to-Hop Congestion Problem in IoT Enabled Intra-Vehicular Communication, The IEEE International Conference on Software Engineering & Computer Systems, Kuantan, August 19-21, 2015. Md. Arafatur Rahman, Roberto Savoia and Mohammad Moshee Uddin, MCAST: Mobility-aware Channel-Availability based Channel Selection Technique, ICNS 2015 : The Eleventh International Conference on Networking and Services, Italy. Soung-Yue Liew, Saiful Azad, Hock Guan Goh, Boon-Yaik Ooi and Arafatur Rahman, A Store-and-delivery Based MAC Protocol for Air-ground Collaborative Wireless Networks for Precision Agriculture, International Workshop on Internet of Things Technologies, Melbourne, Australia (December 14, 2015). A. Zamree Che-aron, Aisha Hassan Abdalla, Khaizuran Abdullah, Wan Haslina Hassan, Md. Arafatur Rahman, A Robust On-Demand Routing Protocol for Cognitive Radio Ad Hoc Networks, 2nd International Conference on International Conference on Mobile and Wireless Technology, Thailand, 2015. Md Arafatur Rahman, Enabling Drone Communications with WiMAX Technology, Fifth International Conference on. Information, Intelligence, Systems and Applications (IISA'2014), Grece. Zamree Che-aron, Aisha Abdalla, Khaizuran Abdullah, Md. Arafatur Rahman, E-D2CARP: A Joint Path and Spectrum Diversity Based Routing Protocol with an Optimized Path Selection for Cognitive Radio Ad Hoc Networks, International Symposium on Telecommunication Technologies (ISTT'14), 2014, Malaysia. Angela Sara Cacciapuoti, Marcello Caleffi, Luigi Paura and Md. Arafatur Rahman, Link Quality Estimators for Multi-Hop Mesh Network, Euro Med Telco Conference (EMTC), 2014, Italy.",
    "researchinterest": "Internet-of-Things (IoT), Wireless Communication Networks, Cognitive Radio Network, 5G, Vehicular Communication, Cyber Physical System, Big Data, Cloud-Fog-Edge Computing, Machine Learning and Security"
  },
  {
    "lecturer": "Dr Thomas Hartley",
    "field": "Senior Lecturer in Computer Science",
    "description": "Thomas Hartley is a specialist in artificial intelligence (AI), in-game learning, computer games development and digital media. He is a senior lecturer in Computer Science at the University of Wolverhampton. He holds a BSc (Hons) in computer science and received his Ph.D from the University of Wolverhampton in 2010. His research interests include artificial intelligence, online learning / in-game learning, machine learning, virtual environments and computer games development. Thomas Hartley is also actively engaged in Knowledge Transfer Partnerships (KTPs) and in applying his research in games technology to non-entertainment areas and funding opportunities. In addition he is on the International Programme Committee for the annual CGAMES Conference and is a reviewer for the CGAMES Conference and the International Journal on Intelligent games and Simulation (IJIGS). ",
    "email": "T.Hartley2@wlv.ac.uk",
    "profile": "https://www.wlv.ac.uk/about-us/our-staff/thomas-hartley/",
    "contact": "01902 321481",
    "publication": "Hartley, T. (2012) Adapting Pathfinding with Potential Energy. In A. Kumar, J. Etheredge, & A. Boudreaux (Eds.), Algorithmic and Architectural Gaming Design: Implementation and Development (pp. 23-39). Hershey, PA: Information Science Reference. doi:10.4018/978-1-4666-1634-9.ch002.Hartley, T. and Mehdi, Q. (2012) In-Game Adaptation of a Navigation Mesh Cell Path. CGAMES 2012 Louisville, Kentucky, USA. Loizou M., Hartley, T., Slater, S., Newman, R. and Pannese, L. (2012) Emotions for Intelligent Agents in Crisis Management Simulations: A Survey. CGAMES 2012 Louisville, Kentucky, USA. Carter, C., Mehdi, Q. and Hartley, T. (2012) Navigational techniques to improve usability and user experience in RPG Games. CGAMES 2012 Louisville, Kentucky, USA. Hartley, T. and Mehdi, Q. (2011) In-Game Tactic Adaptation for Interactive Computer Games. CGAMES 2011 Louisville, Kentucky, USA. Bassey, N., Mehdi Q. and Hartley, T. (2011) Smart Terrain in Online Tactic Agent Decision Making Process. CGAMES 2011 Louisville, Kentucky, USA. Hartley, T. and Mehdi, Q. (2010) Adaptive Tactic Selection in First Person Shooter (FPS) Games. Game Programming Gems 8; ISBN 1584507020. Hartley, T. and Mehdi, Q. (2009) Online action adaptation in interactive computer games. ACM Computers in Entertainment (CIE). Volume 7 , Issue 2  (June 2009). Article No. 28. ISSN:1544-3574. Hartley, T. and Mehdi, Q. (2006) Towards online Adaptation in Action Games: Case Storage and Retrieval, 8th International Conference on Computer Games: AI and Mobile Systems, CGAIMS 2006. Hartley, T. (2005) Online Learning and Adaptation in Computer Games, 7th International Conference on Computer Games, CGAMES 2005, pp. 299-300. Hartley, T., Mehdi, Q., Gough N (2005) Online Learning from Observation for Interactive Computer Games, 6th International Conference on Computer Games: AI and Mobile Systems CGAIMS 2005, July, Louisville, Kentucky, USA. Hartley, T., Mehdi, Q., Gough N. (2004) Using Value Iteration to Solve Sequential Decision Problems in Games. CGAIDE 2004 5th International Conference on Intelligent Games and Simulation (eds. Quasim Medhi, Norman Gough, Stephane Natkin and David Al-Dabass), pp. 293-297. Hartley, T., Mehdi, Q., Gough N. (2004) Applying Markov Decision Processes To 2D Real Time Games. CGAIDE 2004 5th International Conference on Intelligent Games and Simulation (eds. Quasim Medhi, Norman Gough, Stephane Natkin and David Al-Dabass), pp. 55-59..",
    "researchinterest": "My research interests include online learning, in-game learning, machine learning, interactive virtual environments, computer games development, computer games technology and non-entertainment uses for games technology."
  },
  {
    "lecturer": "Dr Vinita Nahar",
    "field": "Senior Lecturer in Computer Science",
    "description": "Vinita Nahar is a Senior Lecturer in Computer Science in the School of Mathematics and Computer Science, Faculty of Science and Engineering (FSE) at the University of Wolverhampton, UK. Before joining FSE, she worked as a Post Doctoral Research Fellow in Natural Language Processing at the Research Group in Computational Linguistics (RGCL), Research Institute in Information and Language Processing (RIILP), University of Wolverhampton, UK.",
    "email": "Vinita.Nahar@wlv.ac.uk",
    "profile": "https://www.wlv.ac.uk/about-us/our-staff/vinita--nahar/",
    "contact": "01902 +44 (0) 1902321460",
    "publication":"Kurtis Weir, Fernando Loizides, Vinita Nahar and Amar Aggoun and Andrew Pollard (2021). I see therefore I read: improving the reading capabilities of individuals with visual disabilities through immersive virtual reality. Universal Access in the Information Society, pp. 1-27. 10.1007/s10209-021-00854-8, Kurtis Weir, Fernando Loizides, Vinita Nahar and Amar Aggoun and Andrew Pollard (2021). Developing a User-Centered Accessible Virtual Reality Video Environment for Severe Visual Disabilities. In The Journal on Technology and Persons with Disabilities. CSUN Assistive Technology Conference, pp. 35–53., He Lin, Vinita Nahar. Reuse of Scientific Data in Academic Publications: an investigation of Dryad Digital Repository. Aslib Journal of Information Management, 64 (4): 478-494, May 2016., Vinita Nahar, Xue Li, Hoong Chuin Lau, Chaoyi Pang. Detecting Cyberbullying in Social Networks based on Positive Unlabelled Learning. International Journal of Web Intelligence and Agent Systems, Special Issue on Multi-agent-based problem solving methods in Big Data Environment and Agent-based Data Mining, pp. 375-388, 2014., Vinita Nahar, Xue Li, Chaoyi Pang. An Effective Approach for Cyberbullying Detection. Journal of Communications in Information Science and Management Engineering (CISME), 3(5): 238-247, 2013., Kurtis Weir, Fernando Loizides, Vinita Nahar and Amar Aggoun and George Buchanan (2020). Creating a Bespoke Virtual Reality Personal Library Space for Persons with Severe Visual Disabilities. In Proceedings of the ACM/IEEE Joint Conference on Digital Libraries (JCDL) 393-396., Kurtis Weir, Fernando Loizides, Vinita Nahar and Amar Aggoun (2019). Using Virtual Reality to Enable Individuals with Severe Visual Disabilities to Read Books. In  Human-Computer Interaction – INTERACT 2019. Lecture Notes in Computer Science, vol 11749 (pp. 680-684). Springer, Cham. https://doi.org/10.1007/978-3-030-29390-1_62 ., Vinita Nahar. Analysis of Swearing Behaviour on Twitter. University of Wolverhampton Annual Research Conference, June 2016., Vinita Nahar, Sanad Al-Maskari, Xue Li and Chaoyi Pang. Semi-Supervised Learning for Detection of Cyberbullying in Social Networks. In the 25th Australasian Database Conference (ADC), 160-171, 2014. Vinita Nahar, Xue Li, Chaoyi Pang and Yang Zhang. Cyberbullying Detection based on Text-Stream Classification. In the Eleventh Australasian Data Mining Conference (AusDM), 49-57, Canberra, Australia, 2013. Vinita Nahar. Analysis and Prediction of Emerging Cyberbullying. In the 2013 UQ Engineering Postgraduate Research Conference, p. 14, Australia, 3, June 2013. Vinita Nahar, Xue Li, Chaoyi Pang. A Step Towards Combating Cyberbullying: Automated Detection. In Proceedings of No2 Bullying Conference, 54-73, Gold Coast, Australia, 2013. Vinita Nahar, Sayan Unankard, Xue Li and Chaoyi Pang. Sentiment Analysis for Effective Detection of Cyber Bullying. In Proceedings of the 14th Asia-Pacific Web Conference (APWeb), 767-774, Kunming, China, 2012. Vinita Nahar. Analysis and Prediction of Emerging Sensitive Social Events. In the 2012 UQ Engineering Postgraduate Research Conference, p. 14 Australia, 2012 [Awarded the best presentation prize (1st yr, ITEE)]. Vinita Nahar. Efficient Detection of Emerging Cyber Bullying. In the 2011 UQ Engineering Postgraduate Research Conference, p. 36 Australia, 2011. Gregory Epiphaniou, Mirko Bottarelli, Haider Al-Khateeb, Nikolaos Th. Ersotelos, John Kanyaru and Vinita Nahar(2020). Smart Distributed Ledger Technologies in Industry 4.0: Challenges and Opportunities in Supply Chain Management, pp. 319–345. In: Jahankhani, H., Kendzierskyj, S., Chelvachandran, N., Ibarra, J. (eds) Cyber Defence in the Age of AI, Smart Societies and Augmented Humanity. Advanced Sciences and Technologies for Security Applications. Springer, Cham. https://doi.org/10.1007/978-3-030-35746-7_15. Vinita Nahar, Xue Li, Chaoyi Pang. Cyberbullying Validation. Bullying: Prevalence, Psychological Impacts and Intervention Strategies, Nova Science Publishers, Inc., USA, 2014. pp. 233-258. Vinita Nahar, Xue Li, Chaoyi Pang. Cyberbullying Prevalence – Medium, Motive and Reaction. Bullying: Prevalence, Psychological Impacts and Intervention Strategies, Nova Science Publishers, Inc., USA, 2014. pp. 259-270. Vinita Nahar, Xue Li, Chaoyi Pang. Towards Combating Cyberbullying by its Detection. Poster presentation in No 2 Bullying Conference, Gold Coast, Australia, 2013. Vinita Nahar, Xue Li, Chaoyi Pang. Approach for Automatic Cyberbullying Detection. In the 2011 EII PhD School in Data Management and Information Retrieval. Australian National University, Australia, September 26 September – 1 October 2011 [Awarded Highly Commended Research Poster]. Vinita Nahar, Xue Li, Chaoyi Pang. On Cyberbullying Detection. PhD Research Poster, Data and Knowledge Engineering (DKE), DKE Day ITEE, UQ, 2011.",
    "researchinterest": "Machine learning, information retrieval, data mining, social media mining, applications of natural language processing, sentiment analysis, sensitive event detection, cyberbullying detection, artificial intelligence, human-computer interaction, and virtual reality."
  },
  {
    "lecturer": "Dr Nurdan Cabukoglu",
    "field": "Lecturer in Computational Mathematics",
    "description": "Nurdan joined the University of Wolverhampton in 2018 as a Lecturer. She has been studying PhD at the University of Leicester since 2015 and completed in 2019. She was teaching in Mathematics and also Engineering Department between 2015 and 2019. She was studying on Animal movement and survive, Mathematical Ecology, Modelling with Prof. Alexander Gorban. Her PhD thesis title is 'Kinesis in Animal Diffusion Dependence of Reproduction Coefficient'. She received previously MSc degree in Mathematics from Istanbul Technical University in 2013 and also an MA in Mathematics Education in 2012. She completed BSc in Mathematics from Yildiz Technical University, Istanbul in 2011.",
    "email": "N.Cabukoglu@wlv.ac.uk",
    "profile": "https://researchers.wlv.ac.uk/n.cabukoglu",
    "contact": "01902518584",
    "publication": "A novel hybrid automaton framework for multi-phase epidemic modelling, Impact of the purposeful kinesis on travelling waves, Mobility cost and degenerated diffusion in kinesis models, Basic model of purposeful kinesis",
    "researchinterest": "Mathematical Ecology, Mathematical Biology, Mathematical Modelling, Population Dynamics, Animal Survive."
  },
  {
    "lecturer": "Dr Paul Wilson",
    "field": "Senior Lecturer in Statistics",
    "description": "I was originally born in London, where I lived until I was 13.  My family then moved to Galway in The Republic of Ireland.  Prior to joining the University of Wolverhampton in 2012 I previously held positions in The University of St Andrews and NUI, Galway.",
    "email": "PaulJWilson@wlv.ac.uk",
    "profile": "https://researchers.wlv.ac.uk/PaulJWilson",
    "contact": "+44 (0)1902 321444 Ext.1444",
    "publication": "Is big team research fair in national research assessments? The case of the UK Research Excellence Framework 2021. Terms in journal articles associating with high quality: can qualitative research be world-leading?, Maternal iron deficiency anaemia in pregnancy: Lessons from a national audit. A Bayesian hurdle quantile regression model for citation analysis with mass points at lower values. A graphical tool for assessing the suitability of a count regression model. A Bayesian Two-part Hurdle Quantile Regression Model for Citation Analysis. Raising aspirations using elements of team-based learning in mathematics: a pilot study. A new algorithm for zero-modified models applied to citation counts.  A new algorithm for zero-modified models applied to citation counts. Prevalence of leadership and management features amongst construction project managers in the UAE. Testing for zero-modification relative to a negative-binomial distribution. A new and intuitive test for zero modification. Sample quantiles corresponding to mid p-values for zero–modification tests. Interactive reading using low cost brain computer interfaces. A diagnostic plot for assessing model fit incount data models. On statistical testing and mean parameter estimation for zero–modification in count data regression. Does research with statistics have more impact? the citation rank advantage of structural equation modelling. Stopped sum models and proposed variants for citation data. A simple and intuitive test for number-inflation or number-deflation. Mendeley readership altmetrics for medical articles: An analysis of 45 fields. The misuse of the Vuong test for non-nested models to test for zero-inflation. Stopped sum models for citation data. Regression for citation data: An evaluation of different methods. The Misuse of The Vuong Test For Non-Nested Models to Test for Zero-Inflation. Pre-Pack Empirical Research: Characteristic and Outcome Analysis of Pre-Pack Administration",
    "researchinterest": "Statistical modelling, especially of count data, with particular emphasis on zero-modified data and assessment of model fit."
  },
  {
  "lecturer": "Dr Ingo Frommholz",
    "field": "Reader in Data Science",
    "description": "I am an expert in search technologies, information retrieval (IR), data science, machine learning, recommender systems, databases, data modelling and management, big data, and digital libraries. I am a passionate programmer and experienced in academia as well as in industry. I have been involved in European and national funded projects on information retrieval, digital libraries, digital preservation and collaboration which have been conducted with highly recognised partners from research and industry. Besides research I have been designing, implementing, integrating and evaluating several research prototypes and software modules and have been leading commercial software projects as a consultant. My research focuses on IR, user-oriented search and digital libraries, with emphasis on polyrepresentation, annotation-based retrieval, interactive quantum-based IR and probabilistic and logic-based models. I am interested in clustering, machine learning, the integration of databases and IR and categorisation.  My research related activities include my engagement as an managing editor of the International Journal on Digital Libraries (http://link.springer.com/journal/799) and on the editorial board of the German Datenbank Spektrum (the joint journal of the German IR and database special interest groups). I am a member of the steering committee of the German Information Retrieval special interest group and of the BCS Information Retrieval Study Group (BCS-IRSG). I have been (senior) programme chair member and reviewer of several world-leading conferences like SIGIR, ECIR, CIKM, ICTIR, JCDL, TPDL. I have been organising several workshops and autumn schools on information retrieval.",
    "email": "I.Frommholz@wlv.ac.uk",
    "profile": "https://researchers.wlv.ac.uk/I.Frommholz",
    "publication": "A Study of Search User Interface Design based on Hofstede's Six Cultural Dimensions,Bibliometric-enhanced Information Retrieval: 12th International BIR Workshop, (BIR 2022), Preface to the 12th Workshop on Bibliometric-enhanced Information Retrieval at ECIR 2022, Semantic Hilbert Space for Interactive Image Retrieval, BIRDS 2021: Bridging the Gap between Information Science, Information Retrieval and Data Science, AQUACOLD: A novel crowdsourced linked data question answering system, Bibliometric-Enhanced Information Retrieval: 11th International BIR Workshop, Crowdsourced Linked Data Question Answering with AQUACOLD, Preface to the 11th workshop on bibliometric-enhanced information retrieval at ECIR 2021, Preface to the 2nd workshop on bridging the gap between information science, information retrieval and data science., Scholarly literature mining with information retrieval and natural language processing: Preface, BIRDS 2020 – Bridging the gap between information science, information retrieval and data science, Reinforcement learning-driven information seeking: A quantum probabilistic approach, Utilising Information Foraging Theory for User Interaction with Image Query Auto-Completion, Bibliometric-enhanced information retrieval: 8th international BIR workshop, Editorial for the 8th bibliometric-enhanced information retrieval workshop at ECIR 2019, The 9th symposium on future directions in information access, Introduction to the special issue on bibliometric-enhanced information retrieval and natural language processing for digital libraries (BIRNDL), Bibliometric-enhanced information retrieval: preface, Quantum-like generalization of complex word embedding: A lightweight approach for textual classification, Classification of colloquial Arabic tweets in real-time to detect high-risk floods, Bibliometric-Enhanced Information Retrieval: 3rd International BIR Workshop, Cluster-based polyrepresentation as science modelling approach for information retrieval (vol 102, pg 2301, 2015), Cluster-based polyrepresentation as science modelling approach for information retrieval, A Hybrid Approach to Combat email-based Cyberstalking, Performance Comparison of top N Recommendation Algorithms, Great War Stories Told by the People - Crowdsourced Cultural Heritage in Digital Museums, An Exploratory Study on eGovernment Systems Success in Saudi Arabia, Preliminary Study of Technical Terminology for the Retrieval of Scientific Book Metadata Records, Processing Queries in Session in a Quantum-Inspired IR Framework, Towards Quantum-Based DB plus IR Processing Based on the Principle of Polyrepresentation, Supporting polyrepresentation in a quantum-inspired geometrical retrieval framework, Guest Editors’ introduction to the focussed issue on the 14th European Conference on Digital Libraries (ECDL 2010), Filtering Documents with Subspaces, Knowledge Modeling in Prior Art Search, Annotation-based document retrieval with Probabilistic logics, The heterogeneous collection track at INEX 2006, Evaluation of relevance and knowledge augmentation in discussion search, Probabilistic, object-oriented logics for annotation-based retrieval in digital libraries, Queries in context: Access to digitized historic documents in a collaboratory for the humanities, Supporting information access in next generation digital library architectures, The role of context for information mediation, Digital libraries as experienced by the editors of the journal, Annotations in digital libraries and collaboratories - Facets, models and usage, The role of context for information mediation in digital libraries, Document-centered collaboration for scholars in the humanities - The COLLATE system",
    "researchinterest": "Information Retrieval, Search Technologies, Digital Libraries, Digital Humanities"
  }
  
]





